### 1-2 파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas

In [2]:
import pandas as pd
CCTV_Seoul = pd.read_csv('./data/01. CCTV_in_Seoul.csv', encoding = 'utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]

'기관명'

In [5]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace = True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

Excel 파일 읽는 법  
근데 그냥 읽게 되면 아래와 같이 이상하게 나오게 된다.  
원본 엑셀 파일의 첫 세 줄이 열의 제목처럼 되어 있기 때문

In [8]:
pop_Seoul = pd.read_excel('./data/01. population_in_Seoul.xls', encoding = 'utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

그래서 추가적인 옵션을 좀 더 많이 적용하도록 한다.
header = 2 즉, 3번째 행부터 읽으라는 옵션을 걸고, B, D, G, J, N 열만 읽도록 옵션을 준다

In [9]:
pop_Seoul = pd.read_excel('./data/01. population_in_Seoul.xls',
                         header = 2,
                         parse_cols = 'B, D, G, J, N',
                         encoding = 'utf-8')
pop_Seoul.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: the 'parse_cols' keyword is deprecated, use 'usecols' instead

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

컬럼 이름 수정  
Dictionary 형태라 {} -> Set 형태로 주어줘야함

In [10]:
pop_Seoul.rename(columns = {pop_Seoul.columns[0] : '구별',
                            pop_Seoul.columns[1] : '인구수',
                            pop_Seoul.columns[2] : '한국인',
                            pop_Seoul.columns[3] : '외국인',
                            pop_Seoul.columns[4] : '고령자'}, inplace = True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

### 1-3 pandas 기초 익히기

In [11]:
import numpy as np
import pandas as pd

In [12]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  3.223082 -0.800910 -0.420089  0.142447
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328
2013-01-05 -0.039165 -1.319835  0.149213  0.436856
2013-01-06  1.206431  0.356910  0.625458  0.873183

head 명령은 기본적으로 첫 5행을 보여주는데 숫자를 지정해주면 그 숫자만큼의 행을 보여준다

In [15]:
df.head(3)

                   A         B         C         D
2013-01-01  3.223082 -0.800910 -0.420089  0.142447
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values

array([[ 3.2230822 , -0.80090993, -0.42008901,  0.14244665],
       [ 0.57403755, -0.05429102,  1.68471546,  1.15103789],
       [ 0.32614031, -0.30834436,  0.5297927 ,  0.05609542],
       [ 0.87033561, -0.68945501, -0.89505033, -0.36932753],
       [-0.03916474, -1.31983454,  0.14921288,  0.4368556 ],
       [ 1.20643101,  0.35691043,  0.62545769,  0.8731829 ]])

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

describe() 명령으로 통계적 개요를 확인 가능  
평균, min, max, 각 1/4 지점, 표준편차 등

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   1.026810 -0.469321  0.279007  0.381715
std    1.158672  0.593735  0.899214  0.559246
min   -0.039165 -1.319835 -0.895050 -0.369328
25%    0.388115 -0.773046 -0.277764  0.077683
50%    0.722187 -0.498900  0.339503  0.289651
75%    1.122407 -0.117804  0.601541  0.764101
max    3.223082  0.356910  1.684715  1.151038

sort_values 명령은 by로 지정된 컬럼을 기준으로 정렬한다  
ascending이 True면 오름차순, False면 내림차순으로 정렬시킨다

In [21]:
df.sort_values(by = 'B', ascending = False)

                   A         B         C         D
2013-01-06  1.206431  0.356910  0.625458  0.873183
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328
2013-01-01  3.223082 -0.800910 -0.420089  0.142447
2013-01-05 -0.039165 -1.319835  0.149213  0.436856

DataFrame 객체인 경우 변수명 뒤에 ['A']와 같이 적어주면 해당 컬럼만 Series로 보여준다  
특정 행만 보고 싶은 경우에는 행의 범위만 지정해서 df[0:3]으로 지정해주면 된다

In [22]:
df['A']

2013-01-01    3.223082
2013-01-02    0.574038
2013-01-03    0.326140
2013-01-04    0.870336
2013-01-05   -0.039165
2013-01-06    1.206431
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  3.223082 -0.800910 -0.420089  0.142447
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095

2013.01.02부터 2013.01.04 까지의 행을 보고 싶다면 다음과 같이 넘겨주면 된다

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328

### loc
특정 변수를 이용하고 싶다면 다음과 같은 형식도 가능하다

In [26]:
df.loc[dates[0]]

A    3.223082
B   -0.800910
C   -0.420089
D    0.142447
Name: 2013-01-01 00:00:00, dtype: float64

특정 열의 모든 행을 보고싶다면 다음과 같이 조건을 주면 된다

In [29]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  3.223082 -0.800910
2013-01-02  0.574038 -0.054291
2013-01-03  0.326140 -0.308344
2013-01-04  0.870336 -0.689455
2013-01-05 -0.039165 -1.319835
2013-01-06  1.206431  0.356910

### iloc
loc 명령과 달리 행과 열의 번호를 이용해서 데이터에 바로 접근할 수 있는 방법도 있다.  
그 명령이 iloc. 행이나 열의 범위를 지정하면 된다.

In [31]:
df.iloc[3]

A    0.870336
B   -0.689455
C   -0.895050
D   -0.369328
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.870336 -0.689455
2013-01-05 -0.039165 -1.319835

DataFrame에서 특정 조건을 만족하는 데이터만 얻어오는 것도 가능하다

In [34]:
df

                   A         B         C         D
2013-01-01  3.223082 -0.800910 -0.420089  0.142447
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328
2013-01-05 -0.039165 -1.319835  0.149213  0.436856
2013-01-06  1.206431  0.356910  0.625458  0.873183

In [35]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  3.223082 -0.800910 -0.420089  0.142447
2013-01-02  0.574038 -0.054291  1.684715  1.151038
2013-01-03  0.326140 -0.308344  0.529793  0.056095
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328
2013-01-06  1.206431  0.356910  0.625458  0.873183

데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 된다

In [36]:
df[df > 0]

                   A        B         C         D
2013-01-01  3.223082      NaN       NaN  0.142447
2013-01-02  0.574038      NaN  1.684715  1.151038
2013-01-03  0.326140      NaN  0.529793  0.056095
2013-01-04  0.870336      NaN       NaN       NaN
2013-01-05       NaN      NaN  0.149213  0.436856
2013-01-06  1.206431  0.35691  0.625458  0.873183

### DataFrame 복사
그냥 = 으로 할당하게 되면 값이 복사되는 것이 아니라 reference 만 복사되기 때문에  
원본 데이터는 하나만 있게 된다.  
copy를 원할 경우는 df.copy()를 이용한다

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']
df2

                   A         B         C         D      E
2013-01-01  3.223082 -0.800910 -0.420089  0.142447    one
2013-01-02  0.574038 -0.054291  1.684715  1.151038    two
2013-01-03  0.326140 -0.308344  0.529793  0.056095  three
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328   four
2013-01-05 -0.039165 -1.319835  0.149213  0.436856   five
2013-01-06  1.206431  0.356910  0.625458  0.873183    six

DataFrame에서 새로운 컬럼 추가

In [42]:
df2['F'] = [1,2,3,4,5,6]
df2

                   A         B         C         D      E  F
2013-01-01  3.223082 -0.800910 -0.420089  0.142447    one  1
2013-01-02  0.574038 -0.054291  1.684715  1.151038    two  2
2013-01-03  0.326140 -0.308344  0.529793  0.056095  three  3
2013-01-04  0.870336 -0.689455 -0.895050 -0.369328   four  4
2013-01-05 -0.039165 -1.319835  0.149213  0.436856   five  5
2013-01-06  1.206431  0.356910  0.625458  0.873183    six  6

어떤 컬럼에서 ~한 요소가 있는지 검사할 때는 isin 명령을 사용

In [45]:
df2['E'].isin(['two','three'])

2013-01-01    False
2013-01-02     True
2013-01-03     True
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

위가 2, 3 행만 True이기 때문에 그 결과를 넣어주면 2, 3행만 뽑힌다

In [46]:
df2[df2['E'].isin(['two','three'])]

                   A         B         C         D      E  F
2013-01-02  0.574038 -0.054291  1.684715  1.151038    two  2
2013-01-03  0.326140 -0.308344  0.529793  0.056095  three  3